
{
  "title":"Calendar",
  "content":"Textbook readings are given as page numbers from this text:\nAng, Alfredo H-S., and Wilson H. Tang. Probability Concepts in Engineering: Emphasis on Applications to Civil and Environmental Engineering. 2nd ed. New York, NY: John Wiley \u0026amp; Sons, 2006. ISBN: 9780471720645.\nThe following table provides information about the lecture (L) and recitation (R) sessions, and also shows when each of the lecture notes and application examples are presented.\nSES # LECTURE TOPICS TEXTBOOK READINGS NOTES EXAMPLES KEY DATES Events, their probability, and two important theorems L1 Introduction. Events and their properties 27-43 L2 Probability of events. Conditional probability, total probability theorem 44-63 1 L3 Independence, Bayes\u0026rsquo; theorem 63-65 1 2, 3, and 4 Homework 1 out R1 Total probability and Bayes\u0026rsquo; theorems Random variables L4 Discrete random variables. Bernoulli and geometric distributions 81-88 and 105-111 5 L5 Binomial and Poisson distributions 112-118 2 6 Homework 1 due\nHomework 2 out\nR2 Discrete random variables L6 Continuous random variables. Uniform and exponential distributions 118-122 L7 Hazard function, distributions of mixed type and distribution mixtures 3 7 and 8 Homework 2 due\nHomework 3 out\nR3 Continuous random variables, and hazard function Quiz 1 Random vectors L8 Discrete random vectors L9 Continuous random vectors 131-136 4 9 Homework 3 due\nHomework 4 out\nR4 Random vectors Uncertainty propagation L10 Functions of random variables; linear functions 151-156 L11 Functions of random variables and vectors; monotonic and min/max functions 157-160 and 172-174 10, 11, and 12 Homework 4 due\nHomework 5 out\nR5 Functions of random variables Quiz 2 L12 Functions of random vectors: sums of variables, gamma distribution 122-125 5 Second moment analysis L13 Expectation, second moment characterization of random variables, probabilistic moments 88-93 Homework 5 due R6 Functions of random variables and vectors L14 Second moment (SM) and first order second moment (FOSM) propagation of uncertainty for variables 180-186 Homework 6 out L15 Second moment characterization of random vectors; covariance and correlation coefficient 138-140 R7 Probabilistic moments, SM and FOSM propagation of uncertainty for variables Quiz 3 L16 SM and FOSM propagation of uncertainty for random vectors 186-189 Homework 6 due L17 SM and FOSM propagation of uncertainty for random vectors 6 13 and 14 Homework 7 out R8 Variance, covariance, correlation, SM and FOSM propagation of uncertainty for random vectors Conditional second moment analysis L18 Conditional SM analysis for variables L19 Conditional SM analysis for vectors 7 15 and 16 Homework 7 due\nHomework 8 out\nR9 Conditional SM analysis for variables Quiz 4 Important distribution models L20 Normal and lognormal distributions 96-105 Homework 8 due\nHomework 9 out\nR10 Conditional SM analysis. Important distribution models L21 Beta, extreme, and multivariate normal distributions 127-131, 137, and 175-179 8 17 and 18 Statistics L22 Estimation of distribution parameters: general principles Homework 9 due R11 Estimation of distribution parameters Quiz 5 L23 Method of moments 246-251 Homework 10 out L24 Maximum likelihood and Bayesian estimation 251-254 and 346-357 9 19 Homework 10 due L25 Simple and multiple linear regression 306-309, 313-318, and 321-325 R12 Maximum likelihood and Bayesian estimation L26 Pre-final review "}


